class VoucherGen:
    # 科目代码与科目名称的映射关系
    subject_mapping = {
        '2606010101': '未到期责任负债-未来现金流-新增非亏损合同-预期未来现金流入',
        '2606030101': '未到期责任负债-合同服务边际-新增非亏损合同',
        '2606010103': '未到期责任负债-未来现金流-新增非亏损合同-预期支付的保险获取现金流',
        '2606010102': '未到期责任负债-未来现金流-新增非亏损合同-预期未来现金流出',
        '2606020101': '未到期责任负债-非金融风险调整-新增非亏损合同',
        '2606010801': '未到期责任负债-未来现金流-现金流/保费-保费收入',
        '2606011001': '未到期责任负债-未来现金流-现金流/获取费用-手续费及佣金支出/手续费',
        '2606011002': '未到期责任负债-未来现金流-现金流/获取费用-手续费及佣金支出/佣金',
        '2606010601': '未到期责任负债-未来现金流-预期理赔和费用-保险成分',
        '2606040404': '未到期责任负债-亏损部分-亏损部分摊销-亏损部分摊销',
        '2606030401': '未到期责任负债-合同服务边际-合同服务边际摊销',
        '2606011601': '未到期责任负债-未来现金流-获取费用摊销计入收入-获取费用摊销计入收入',
        '2606011701': '未到期责任负债-未来现金流-获取费用摊销计入支出-获取费用摊销计入支出',
        '2606020301': '未到期责任负债-非金融风险调整-非金融风险调整的变化-非金融风险调整释放',
        '2606010401': '未到期责任负债-未来现金流-不调整合同服务边际-亏损后续确认/转回',
        '2606020401': '未到期责任负债-非金融风险调整-不调整合同服务边际-亏损后续确认/转回',
        '2606040401': '未到期责任负债-亏损部分-亏损部分摊销-当期亏损合同损失分摊/BEL',
        '2606040403': '未到期责任负债-亏损部分-亏损部分摊销-当期亏损合同损失分摊/RA',
        '2606011403': '未到期责任负债-未来现金流-保险财务费用-保险财务费用',
        '2606020601': '未到期责任负债-非金融风险调整-保险财务费用',
        '2606030301': '未到期责任负债-合同服务边际-保险财务费用'
    }

    def __init__(self, policy_number,  subject_code, amount):
        self.voucher_id = None  # 假设凭证 ID 由外部系统生成
        self.policy_number = policy_number

        self.subject_code = subject_code
        self.subject_name = self.get_subject_name(subject_code)
        self.amount = amount

    @classmethod
    def get_subject_name(cls, subject_code):
        """根据科目代码获取科目名称"""
        return cls.subject_mapping.get(subject_code, '未知科目')

    def to_dict(self):
        return {
            '凭证ID': self.voucher_id,
            '保单号': self.policy_number,

            '科目代码': self.subject_code,
            '科目名称': self.subject_name,
            '金额': self.amount
        }

